getting_started/app/controllers/articles_controller.rb

  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("content", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)