using_script/Depot-master/app/controllers/products_controller.rb

INSERT INTO `products` (`created_at`, `description`, `image_url`, `price`, `title`, `updated_at`) VALUES ('2013-01-01 05:52:54', 'MyText', 'MyString', 10, 'MyString', '2013-01-01 05:52:54')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT `products`.* FROM `products` WHERE `products`.`id` = 980190962 LIMIT 1
---
  def update
    @product = Product.find(params[:id])