using_script/Depot-master/app/controllers/store_controller.rb

  def index
  	if params[:set_locale]
  		redirect_to store_path(locale: params[:set_locale])
  	else
     # Product to display index page
  		@products = Product.order(:title)
---
SELECT `products`.* FROM `products` ORDER BY title